Revit 2024 API
Group.ShowAllAttachedDetailGroups Method
 Shows all the available attached detail groups for this element group type that are compatible with the input view type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.1
Syntax
C#
public void ShowAllAttachedDetailGroups(
	View view
)
Visual Basic
Public Sub ShowAllAttachedDetailGroups ( _
	view As View _
)
Visual C++
public:
void ShowAllAttachedDetailGroups(
	View^ view
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view that the attached detail groups must be compatible with.
Remarks
 Currently, perpendicular elevation views (for example, North and East views) are considered compatible when deciding whether or not to allow a detail group to be displayed in a view. The show operation may generate an error (FailureMessage) based on id if the orientation of the annotations do not match the orientation of the target view (for example, the failure definition DimensionPerpendicularToView). To prevent displaying detail groups in the wrong view, you can check the OwnerViewId of a detail group to make sure it matches the view in which you are trying to display it.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The input group is not a model group and can therefore not have attached detail groups. -or- This exception is thrown if this group's attached detail groups cannot be found in the current document.
See Also
Group Class
Autodesk.Revit.DB Namespace